"""
Программный модуль для перевода времени представленного в нормальном виде, в двоичную Морзе-форму.

 Каждая цифра в написании времени представлена разным количеством бинарных знаков.
 Первая цифра в "часах" состоит из двух знаков, тогда как вторая цифра -- из четырех.
  Первая цифра "минут" и "секунд" состоят из трех знаков и вторые цифры -- из четырех.
  Каждая цифра должна быть переведена в двоичный вид.
 Затем замените каждую единицу (1) на тире ("-") и каждый ноль (0) на точку (".").

 Время может быть представлено в следующем виде: "hh:mm:ss", "h:m:s" или "hh:m:ss"
"Пропущеные" цифры - это нули. Для примера, "1:2:3" тоже самое, что и "01:02:03".
Окончательная морзе-форма времени должна быть написана в следующем формате:

"h h : m m : s s"

где каждая цифра - это последовательность "." и "-"

Ввод: Нормальная запись времени, представленая строкой (str).
Вывод: Переработаная морзе-форма времени, представленая строкой (str).

Примеры:

morze("10:37:49") == ".- .... : .-- .--- : -.. -..-"
morze("21:34:56") == "-. ...- : .-- .-.. : -.- .--."
morze("00:1:02") == ".. .... : ... ...- : ... ..-."
morze("23:59:59") == "-. ..-- : -.- -..- : -.- -..-"

"""


def check_bin(num):
    if int(num) != 0:
        return bin(int(num)).lstrip("0b")
    else:
        return '0'


def check_len(num, length):
    while len(num) != length:
        num = "0" + str(num)
        if len(num) == length:
            return num
    return num


def morze(time_string):
    time = time_string.split(":")

    for i in range(len(time)):
        if len(time[i]) < 2:
            time[i] = "0" + time[i]

    time = ''.join(time)

    h1 = check_len(check_bin(time[0]), 2)
    h2 = check_len(check_bin(time[1]), 4)
    m1 = check_len(check_bin(time[2]), 3)
    m2 = check_len(check_bin(time[3]), 4)
    s1 = check_len(check_bin(time[4]), 3)
    s2 = check_len(check_bin(time[5]), 4)

    result = ['%s %s : ' % (h1, h2), '%s %s : ' % (m1, m2), '%s %s' % (s1, s2)]
    return ''.join(result).replace('1', '-').replace('0', '.')
